var plantName = [
"OT多娜托-OT多娜托"
,"OT多娜托-三朵"
,"OT多娜托-多朵"
,"OT多娜托-雙朵"
,"OT曼尼薩-OT曼尼薩"
,"OT曼尼薩-三朵"
,"OT曼尼薩-單朵"
,"OT曼尼薩-多朵"
,"OT曼尼薩-雙朵"
,"OT羅賓娜-OT羅賓娜"
,"OT羅賓娜-三朵"
,"OT羅賓娜-單朵"
,"OT羅賓娜-多朵"
,"OT羅賓娜-雙朵"
,"七里香-七里香"
,"九層塔"
,"伯利恆之星-伯利恆之星"
,"八卦草(黃河)-八卦草(黃河)"
,"八角金盤-八角金盤"
,"其他"
,"其他-進口"
,"其他花類"
,"其他菇類-其他菇類"
,"其他蔬菜"
,"其它花卉-其它花卉"
,"冬瓜-白皮"
,"切葉類-切葉類"
,"劍蘭-混合色"
,"劍蘭-青殼粉"
,"劍蘭-２３５號"
,"劍蘭-２６５號"
,"包心白-進口"
,"包心白菜-其他"
,"包心白菜-冬白芽"
,"包心白菜-包白"
,"包心白菜-包頭蓮"
,"包心白菜-成功白"
,"千代蘭-千代蘭"
,"半天筍"
,"南瓜-其他"
,"南瓜-圓形"
,"南瓜-木瓜形"
,"南瓜-觀賞"
,"南瓜-青如意"
,"南瓜-黃如意"
,"卡斯比亞-無葉"
,"向日葵-單瓣"
,"向日葵-太陽神"
,"唐棉-唐棉"
,"嘉蘭<火焰百合>-嘉蘭<火焰百合>"
,"壽松-壽松"
,"夜來香-單瓣"
,"夜來香-重瓣"
,"大文心蘭-大文心蘭"
,"大菊-大菊"
,"大菊-混合色"
,"大蒜-硬梗"
,"大蒜-蒜仁"
,"大蒜-蒜瓣"
,"大蒜-蒜頭"
,"大蒜-軟梗"
,"天堂鳥-天堂鳥"
,"天堂鳥葉-天堂鳥葉"
,"奇異果-進口"
,"小天堂鳥-桔帶紅"
,"小番茄-一般"
,"小番茄-其他"
,"小番茄-玉女"
,"小番茄-聖女"
,"小白菜-其他"
,"小白菜-土白菜"
,"小白菜-蚵仔白"
,"小菊-小菊"
,"小菊-染色小菊"
,"小菊-混合色"
,"小菊-白"
,"小菊-粉"
,"小菊-老虎紅"
,"小菊-金"
,"小菊-黃"
,"尤加利葉-尤加利葉"
,"山蘇葉-山蘇葉"
,"山防風-山防風"
,"巴西利"
,"希拉-三朵"
,"希拉-多朵"
,"希拉-希拉"
,"希拉-雙朵"
,"康乃馨-多朵(混色)"
,"康乃馨-多朵櫻紅"
,"康乃馨-多朵粉"
,"康乃馨-櫻紅"
,"康乃馨-混合色"
,"扁柏-扁柏"
,"扁蒲-圓形"
,"扁蒲-梨子蒲"
,"扁蒲-花蒲"
,"扁蒲-長形"
,"拖鞋蘭-拖鞋蘭"
,"敏豆-白豆"
,"敏豆-粉豆"
,"敏豆-翼豆"
,"敏豆-醜豆"
,"斑葉蘭-斑葉蘭"
,"新文竹-新文竹"
,"星辰花-大湖魅力"
,"星辰花-混色"
,"星辰花-粉"
,"星辰花-紫"
,"星辰花-黃"
,"星點木-星點木"
,"春樹蘭-香樹蘭"
,"木瓜-一般紅肉"
,"木瓜-日昇種"
,"木瓜-網室紅肉"
,"木瓜-青木瓜"
,"朴菜"
,"李-其他"
,"杏鮑菇"
,"杏鮑菇-盒裝"
,"柳松菇"
,"柳松菇-盒裝"
,"桶筍-桂竹筍"
,"桶筍-箭竹筍"
,"桶筍-綠竹筍"
,"桶筍-麻竹筍"
,"椪柑-進口"
,"椰子"
,"楊桃-軟枝蜜絲"
,"楊桃-馬來亞種"
,"檸檬綠文心蘭-檸檬綠文心蘭"
,"毛豆-豆仁"
,"毛豆-豆莢"
,"水仙百合-混色"
,"水仙百合-白"
,"水仙百合-粉"
,"水晶香水-三朵"
,"水晶香水-多朵"
,"水晶香水-水晶香水"
,"水晶香水-雙朵"
,"水燭葉-水燭葉"
,"油菜"
,"波羅蜜"
,"洋桔梗-洋桔梗"
,"洋桔梗-羅西娜紫"
,"洋桔梗-艾瑞娜桃"
,"洋桔梗-艾瑞娜粉"
,"洋桔梗-雙瓣(混色)"
,"洋桔梗-雙瓣白"
,"洋桔梗-雙瓣白紫邊"
,"洋桔梗-雙瓣粉"
,"洋桔梗-雙瓣紫"
,"洋桔梗-雙瓣綠"
,"洋桔梗-順風綠"
,"洋菇"
,"洋菇(盒)-盒裝"
,"洋蔥-本產"
,"洋蔥-進口"
,"洋香瓜-光面白肉"
,"洋香瓜-光面綠肉"
,"洋香瓜-網狀紅肉"
,"洋香瓜-網狀綠肉"
,"海芋-黃"
,"海菜-海帶"
,"深山櫻-深山櫻"
,"溼香菇"
,"滿天星-牽牛星"
,"滿天星-雪子"
,"濕木耳"
,"火鶴花-丘比特"
,"火鶴花-千里達"
,"火鶴花-吉祥"
,"火鶴花-咖啡條紋"
,"火鶴花-嘉年華"
,"火鶴花-夏粉"
,"火鶴花-夢幻"
,"火鶴花-大地"
,"火鶴花-太極"
,"火鶴花-小紅莓"
,"火鶴花-小耳朵"
,"火鶴花-彩虹"
,"火鶴花-月亮女神"
,"火鶴花-月光"
,"火鶴花-桔綠邊"
,"火鶴花-森林"
,"火鶴花-橙色"
,"火鶴花-混色"
,"火鶴花-火鶴花"
,"火鶴花-王妃"
,"火鶴花-珊瑚粉"
,"火鶴花-白色"
,"火鶴花-白青心"
,"火鶴花-粉佳人"
,"火鶴花-粉新娘"
,"火鶴花-粉綠邊"
,"火鶴花-粉色"
,"火鶴花-紅綠邊"
,"火鶴花-紅色"
,"火鶴花-紅青心"
,"火鶴花-綠寶石"
,"火鶴花-綠紅心"
,"火鶴花-總統"
,"火鶴花-羅莎"
,"火鶴花-翠綠"
,"火鶴花-花仙子"
,"火鶴花-花紫"
,"火鶴花-荷粉"
,"火鶴花-蘋果綠"
,"火鶴花-超音速"
,"火鶴花-辛巴"
,"火鶴花-雷夢娜"
,"火鶴花-香檳"
,"火鶴花-黃瑪莉"
,"火鶴花-黑珍珠"
,"火鶴葉-火鶴葉"
,"火龍果-火龍果"
,"火龍果-白肉"
,"火龍果-紅肉"
,"熟筍-桂竹筍"
,"熟筍-箭竹筍"
,"牛蒡"
,"牛蒡-進口"
,"玉米-其他"
,"玉米-玉米筍"
,"玉米-甜硬殼"
,"玉米-甜軟殼"
,"玉米-白玉米"
,"玉米-糯米(白)"
,"玉米-糯米(黑)"
,"玉米-超甜白"
,"玉米-進口"
,"玉羊齒-玉羊齒"
,"玫瑰-佳娜紅"
,"玫瑰-冰火"
,"玫瑰-卡蜜拉"
,"玫瑰-卡門"
,"玫瑰-吾愛"
,"玫瑰-埔里之星"
,"玫瑰-山中傳奇"
,"玫瑰-新櫻紅"
,"玫瑰-新香檳粉"
,"玫瑰-東方之星"
,"玫瑰-水精靈"
,"玫瑰-混合色"
,"玫瑰-玫瑰"
,"玫瑰-甜心"
,"玫瑰-紅衣武士"
,"玫瑰-紫天王"
,"玫瑰-紫愛你"
,"玫瑰-翡翠佳人"
,"玫瑰-翡翠白"
,"玫瑰-翡翠粉"
,"玫瑰-翡翠香檳"
,"玫瑰-胭脂"
,"玫瑰-萬年紅"
,"玫瑰-迷你混合"
,"玫瑰-迷你粉"
,"玫瑰-迷你紅"
,"玫瑰-迷你黃"
,"玫瑰-鐵達尼"
,"玫瑰-黃"
,"玫瑰-黛安娜粉"
,"珊瑚菇"
,"珊瑚菇-盒裝"
,"珊瑚鳳梨-珊瑚鳳梨"
,"球莖甘藍"
,"甘蔗-帶皮"
,"甘薯-其他"
,"甘薯-改良種"
,"甘薯-芋仔甘藷"
,"甘藍-初秋"
,"甘藍-改良種"
,"甘藍-甘藍心"
,"甘藍-甘藍芽"
,"甘藍-紫色"
,"甘藷葉"
,"甜椒-彩色種"
,"甜椒-新香"
,"甜椒-青椒"
,"甜橙-進口"
,"番石榴-其他"
,"番石榴-帝王芭"
,"番石榴-水晶無仔"
,"番石榴-珍珠芭"
,"番石榴-紅心"
,"白竹-白竹"
,"百合"
,"百合竹-百合竹"
,"百果-進口"
,"百香果-改良種"
,"皇宮菜-大葉"
,"皇宮菜-小葉"
,"睡蓮-睡蓮"
,"石斛蘭-混合色"
,"石蓮花"
,"秀珍菇"
,"秀珍菇(盒)-盒裝"
,"秀線-秀線"
,"竹筍-去殼"
,"竹筍-烏殼綠"
,"竹筍-綠竹筍"
,"竹筍-麻竹筍"
,"筍乾"
,"筍片"
,"筍絲"
,"筍茸"
,"粉孔雀-粉孔雀"
,"紅竹-紅竹"
,"紅薑花-紅"
,"紅鳳菜-紅鳳菜"
,"紐西蘭麻-紐西蘭麻"
,"紫孔雀-紫孔雀"
,"絲瓜-白瓜"
,"絲瓜-絲瓜"
,"絲瓜-角瓜"
,"綠春蘭葉-綠春蘭葉"
,"繡球花-繡球花"
,"胡瓜-改良種"
,"胡瓜-黑刺"
,"胡蘿蔔-未洗"
,"胡蘿蔔-清洗"
,"胡蘿蔔-進口"
,"腎藥蘭-腎藥蘭"
,"芋-檳榔心芋"
,"芋-芋莖"
,"芋-里芋"
,"芋-麵芋"
,"芒果-其他"
,"芒果-芒果青"
,"芥菜-大芥菜"
,"芥菜-小芥菜"
,"芥藍菜"
,"芥藍菜-芥藍芽"
,"芫荽"
,"花椰菜-白梗"
,"花椰菜-青梗"
,"花胡瓜"
,"花胡瓜-其他"
,"芹菜-山芹菜"
,"芹菜-白梗"
,"芹菜-西洋芹菜"
,"芹菜-進口"
,"芹菜-青梗"
,"芽菜類-綠豆芽"
,"芽菜類-苜宿芽"
,"芽菜類-豌豆嬰"
,"芽菜類-黃豆牙"
,"苦瓜-其他"
,"苦瓜-白大米"
,"苦瓜-翠綠"
,"苦瓜-青大米"
,"茄子-日本種"
,"茄子-胭脂茄"
,"茄子-麻荸茄"
,"茉莉花-茉莉花"
,"茭白筍-去殼"
,"茭白筍-帶殼"
,"茴香"
,"草莓-進口"
,"草菇"
,"荸薺"
,"荸薺-加工"
,"莧菜-白莧菜"
,"莧菜-紅莧菜"
,"菜豆-白色"
,"菜豆-青色"
,"菠菜-圓葉"
,"菠菜-角葉"
,"菱角-去殼"
,"萊豆-豆仁"
,"萊豆-豆莢"
,"萬代蘭-萬代蘭"
,"萵苣菜-其他"
,"萵苣菜-廣東萵"
,"萵苣菜-本島圓葉"
,"萵苣菜-本島尖葉"
,"萵苣菜-水耕"
,"萵苣菜-油麥菜"
,"萵苣菜-結球萵"
,"萵苣菜-蘿美"
,"萵苣菜-進口"
,"落花生-熟落花生"
,"落花生-生落花生"
,"葉蘭-葉蘭"
,"葡萄-巨峰"
,"葡萄-進口"
,"葡萄柚-紅肉"
,"葡萄柚-進口紅肉"
,"葵百合-阿卡波克紅"
,"葵百合-阿卡波克紅三朵"
,"葵百合-阿卡波克紅多朵"
,"葵百合-阿卡波克紅雙朵"
,"蓮藕"
,"蓮藕-蓮子"
,"蓮藕-進口"
,"蓮霧-紅蓮霧"
,"蕃茄-牛蕃茄"
,"蕃茄-黑柿"
,"蕨菜-山蘇"
,"蕨菜-過貓"
,"蕹菜-大葉"
,"蕹菜-小葉"
,"薇薇安娜-三朵"
,"薇薇安娜-多朵"
,"薇薇安娜-薇薇安娜"
,"薇薇安娜-雙朵"
,"薑-其他"
,"薑-嫩薑"
,"薑-粉薑"
,"薑-老薑"
,"薯蕷-白薯蕷"
,"薯蕷-紅薯蕷"
,"薯蕷-進口"
,"藍莓-進口藍莓"
,"藤川七-川七葉"
,"蘆筍-白蘆筍"
,"蘆筍-綠蘆筍"
,"蘆筍-進口"
,"蘋果-其他(進口)"
,"蘋果-富士(進口)"
,"蘭花-蘭花"
,"蘿蔔-梅花"
,"蘿蔔-矸仔"
,"蘿蔔乾"
,"虎斑木葉-虎斑木葉"
,"蝴蝶蘭-混色"
,"蝴蝶蘭-白紅心"
,"蝴蝶蘭-白黃心"
,"蝴蝶蘭-粉色"
,"蝴蝶蘭-紅色"
,"蝴蝶蘭-黃色"
,"蠔菇-鮑魚菇"
,"西洋菜"
,"西瓜-大西瓜"
,"西瓜-黃肉"
,"觀花鳳梨花-觀花鳳梨花"
,"豆薯"
,"豌豆-甜豌豆"
,"豌豆-白花"
,"豌豆-紅花"
,"豌豆-豌豆苗"
,"辣椒-其他"
,"辣椒-朝天椒"
,"辣椒-糯米椒"
,"辣椒-紅小"
,"辣椒-雞心"
,"辣椒-青小"
,"辣椒-青龍"
,"進口其它花卉-進口其它花卉"
,"進口大菊-白乒乓"
,"進口大菊-綠乒乓"
,"進口大菊-綠絲菊"
,"進口大菊-進口大菊"
,"進口大菊-黃乒乓"
,"進口孤挺花-進口孤挺花"
,"進口小菊-進口小菊"
,"進口康乃馨-中大輪"
,"進口康乃馨-多朵混色"
,"進口康乃馨-櫻紅"
,"進口康乃馨-混合色"
,"進口康乃馨-粉"
,"進口康乃馨-紅"
,"進口康乃馨-紫"
,"進口樺木(假葉)-進口樺木(假葉)"
,"進口石斛蘭-深紅"
,"進口石斛蘭-白"
,"進口繡球花-進口繡球花"
,"酪梨"
,"醃瓜-乾"
,"醃瓜-漬"
,"野薑花-白"
,"金絲菇"
,"金絲菇(盒)-盒裝"
,"金針花-進口"
,"鋸齒蔓綠絨葉-鋸齒蔓綠絨葉"
,"鐵砲百合-雷山一號三朵"
,"鐵砲百合-雷山一號單朵"
,"鐵砲百合-雷山一號雙朵"
,"長春籐-長春籐"
,"隼人瓜"
,"隼人瓜苗-瓜苗"
,"雜柑-其他"
,"雜柑-桔子"
,"雜柑-檸檬"
,"雜柑-無子檸檬"
,"雞冠花-暗紅"
,"雞冠花-清紅"
,"雞冠花-綠"
,"雞冠花-雞冠花"
,"雪松-雪松"
,"雪裡紅"
,"電信蘭葉-電信蘭葉"
,"青江白菜-小梗"
,"青竹-青竹"
,"青花苔"
,"青蔥-北蔥"
,"青蔥-日蔥"
,"青蔥-粉蔥"
,"青蔥-紅蔥頭"
,"非洲菊-伊斯瑪拉"
,"非洲菊-哈比"
,"非洲菊-太陽神"
,"非洲菊-希蘿"
,"非洲菊-梅蘿絲"
,"非洲菊-橙"
,"非洲菊-沙丘"
,"非洲菊-混合色"
,"非洲菊-白"
,"非洲菊-白雪"
,"非洲菊-粉"
,"非洲菊-粉紅魅力"
,"非洲菊-粉美麗"
,"非洲菊-紅"
,"非洲菊-紫"
,"非洲菊-蘿瑞托"
,"非洲菊-迷你混色"
,"非洲菊-非洲菊"
,"非洲菊-黃"
,"韭菜-白頭"
,"韭菜-青頭"
,"韭菜-韭菜花"
,"韭菜-韭菜黃"
,"香水百合"
,"香水百合-三朵"
,"香水百合-凱麗湖"
,"香水百合-凱麗湖三朵"
,"香水百合-凱麗湖雙朵"
,"香水百合-單朵"
,"香水百合-多朵"
,"香水百合-康卡多"
,"香水百合-康卡多三朵"
,"香水百合-康卡多單朵"
,"香水百合-康卡多多朵"
,"香水百合-康卡多雙朵"
,"香水百合-瑪度沙三朵"
,"香水百合-瑪度沙多朵"
,"香水百合-白"
,"香水百合-白三朵"
,"香水百合-白多朵"
,"香水百合-白雙朵"
,"香水百合-粉"
,"香水百合-粉三朵"
,"香水百合-粉多朵"
,"香水百合-粉雙朵"
,"香水百合-紅"
,"香水百合-紅三朵"
,"香水百合-紅單朵"
,"香水百合-紅多朵"
,"香水百合-紅雙朵"
,"香水百合-索邦妮"
,"香水百合-索邦妮三朵"
,"香水百合-索邦妮多朵"
,"香水百合-索邦妮雙朵"
,"香水百合-耶蘿琳"
,"香水百合-耶蘿琳三朵"
,"香水百合-耶蘿琳多朵"
,"香水百合-耶蘿琳雙朵"
,"香水百合-雙朵"
,"香水百合-香水百合"
,"香水百合-馬可波羅粉"
,"香水百合-馬可波羅粉三朵"
,"香水百合-馬可波羅粉單朵"
,"香水百合-馬可波羅粉多朵"
,"香水百合-馬可波羅粉雙朵"
,"香水百合-黃"
,"香水百合-黃多朵"
,"香水百合-黃雙朵"
,"香蕉"
,"香蕉-其他"
,"香蕉-旦蕉"
,"香蕉-芭蕉"
,"馬鈴薯-本產"
,"馬鈴薯-進口"
,"高山羊齒-高山羊齒"
,"高梁-高梁"
,"鳳梨-金鑽鳳梨"
,"鳳梨-開英"
,"鳳梨花-鳳梨花"
,"鴻禧菇"
,"鴻禧菇-盒裝"
,"鶴焦-鶴焦"
,"鶴蕉紅美人-鶴蕉紅美人"
,"鹹菜-帶葉"
,"鹹菜-清心"
,"麒麟草-麒麟草"
,"黃梔花-黃梔花"
,"黃椰心-黃椰心"
,"黃椰心葉-葉"
,"黃秋葵"
,"黃金側柏-黃金側柏"
,"黃金竹-黃金竹"
,"黃金鳥-黃金鳥"
,"黑甜仔菜"
,"龍文蘭-龍文蘭"
,"龍眼-龍眼肉"
];

$('.dropdown-button').pushpin({ top: $('.dropdown-button').offset().top });


$('.dropdown-button').dropdown({
    inDuration: 300,
    outDuration: 225,
    constrain_width: false, // Does not change width of dropdown to that of the activator
    hover: true, // Activate on hover
    gutter: 0, // Spacing from edge
    belowOrigin: true, // Displays dropdown below the button
    alignment: 'left' // Displays dropdown with edge aligned to the left of button
  }
);

for(var i = 0; i < plantName.length; i++){
  $("#dropdown1").append('<li><a href="/api/' + plantName[i] + '">' + plantName[i] + '</a></li>');
}

function onPlantClick(newText, href) {
  $('#tag-list div').remove();
  $('.dropdown-button').text(newText);
  $.ajax(href, {
    type: 'GET',
    data: {
      format: 'json'
    },
    success: function(data) {
      var labels = [];
      var prices = [];
      var sold = [];
      var prices_sold = [];

      data.sort(function(a, b){
        return new Date(a.time) - new Date(b.time); 
      });

      data.map(function(d){
        console.log(d);
        var t = new Date(d.time);
        var m = t.getMonth() + 1
        labels.push(t.getFullYear() + '/' + m);
        
        prices.push(d.average_price);
        sold.push(d.average_quantity);
        var mul = d.average_price * d.average_quantity / 1000;
        prices_sold.push(mul);
        
        // console.log(d.average_price * d.average_quantity / 1000 + 'k');
      });

      var options = {
        width: 2500,
        //height: 200,
        fullWidth: true,
        chartPadding: {
          right: 40
        },
        
      };
      new Chartist.Line('.ct-chart-price', {
          labels: labels,
          series: [
            prices,
          ]
        }, options);

      new Chartist.Line('.ct-chart-sold', {
          labels: labels,
          series: [
            sold,
          ]
        }, options);

      new Chartist.Line('.ct-chart-mult', {
          labels: labels,
          series: [
            prices_sold,
          ]
        }, Object.assign({}, options,{
            axisY: {
              offset: 60,
              labelInterpolationFnc: function(value) {
                return value + 'k';
              }
            }
          })
        );

      var group = data[0].group;
      // console.log('group ' + group);
      // getGroup
      $.ajax('group/' + group, {
        type: 'GET',
        data: {
          format: 'json'
        },
        success: function(data) {
          data = _.uniqBy(data, 'name');
          data.map(function(d){
            if(d.name != newText)
              $('#tag-list').append('<div class="chip"><a href="/api/' + d.name   + '">' + d.name + '</a></div>');
            

          })
        },
        error: function(){
          console.log("cant get group");
        }
      });
      
    },
    error: function() {
      console.log('cant get data');
    }
  }); 
}

$("#dropdown1 li a").click(function (e){
  e.preventDefault();
  var newText = $(this).text();
  var href = this.href;
  onPlantClick(newText, href);


});

$(document).on('click', '#tag-list div a', function (e){
    e.preventDefault();
    var newText = $(this).text();
    var href = this.href;
    onPlantClick(newText, href);
});




/* chart */
// new Chartist.Line('.ct-chart', {
//   labels: ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday'],
//   series: [
//     [12, 9, 7, 8, 5],
//     [2, 1, 3.5, 7, 3],
//     [1, 3, 4, 5, 6]
//   ]
// }, {
//   fullWidth: true,
//   chartPadding: {
//     right: 40
//   }
// });


